state
( Process.E Obs.E2 ) 
[ yr=0 t=0 #time=0 ]

delay 0.052210523807431290232994314237658

state
( Process.E Obs.E2 ) 
[ yr=0.052210523807431290232994314237658 t=0.052210523807431290232994314237658 #time=0.052210523807431290232994314237658 ]

transition
Process.E->Process.G2 { 1, hello!, 1 }

state
( Process.G2 Obs.E2 ) 
[ yr=0.052210523807431290232994314237658 t=0.052210523807431290232994314237658 #time=0.052210523807431290232994314237658 ]

delay 0.32087201971781481590895168665156

state
( Process.G2 Obs.E2 ) 
[ yr=0.37308254352524611308083990479645 t=0.37308254352524611308083990479645 #time=0.37308254352524611308083990479645 ]

transition
Obs.E2->Obs.E21 { 1, new!, 1 }

state
( Process.G2 Obs.E21 ) 
[ yr=0.37308254352524611308083990479645 t=0.37308254352524611308083990479645 #time=0.37308254352524611308083990479645 ]

delay 1.4568010648162443843034452584106

state
( Process.G2 Obs.E21 ) 
[ yr=1.8298836083414904418731339319493 t=1.8298836083414904418731339319493 #time=1.8298836083414904418731339319493 ]

transition
Obs.E21->Obs.E22 { 1, syncTime!, 1 }

state
( Process.G2 Obs.E22 ) 
[ yr=1.8298836083414904418731339319493 t=1.8298836083414904418731339319493 #time=1.8298836083414904418731339319493 ]

delay 3.4305946473220241266233188071055

state
( Process.G2 Obs.E22 ) 
[ yr=5.2604782556635143464518478140235 t=5.2604782556635143464518478140235 #time=5.2604782556635143464518478140235 ]

transition
Obs.E22->Obs.F2 { 1, lower!, 1 }

state
( Process.G2 Obs.F2 ) 
[ yr=5.2604782556635143464518478140235 t=5.2604782556635143464518478140235 #time=5.2604782556635143464518478140235 ]

delay 0.70242343363250636656403003144078

state
( Process.G2 Obs.F2 ) 
[ yr=5.9629016892960207130158778454643 t=5.9629016892960207130158778454643 #time=5.9629016892960207130158778454643 ]

transition
Obs.F2->Obs.F21 { 1, new!, 1 }

state
( Process.G2 Obs.F21 ) 
[ yr=5.9629016892960207130158778454643 t=5.9629016892960207130158778454643 #time=5.9629016892960207130158778454643 ]

delay 994.13709831070400468888692557812

state
( Process.G2 Obs.F21 ) 
[ yr=1000.1000000000000227373675443232 t=1000.1000000000000227373675443232 #time=1000.1000000000000227373675443232 ]

[2K -- Formula is satisfied.
1:
[0]: (0,1) (1000.1,1)
